tutorials/CFD/26MovingAirfoil/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    aerofoil
    {
        type            calculated;
        value           nonuniform List<vector> 
300
(
(-22.525857 0 -0.021241622)
(-22.685097 0 -0.05107216)
(-22.840818 -2.4697455e-21 -0.081939883)
(-22.992988 0 -0.11353644)
(-23.141627 9.5140858e-21 -0.14588459)
(-23.286652 0 -0.1792002)
(-23.427996 0 -0.21335054)
(-23.565744 1.7603975e-20 -0.24826497)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
